:PROPERTIES:
:ID:       23259274-560e-42a9-87eb-e633a9dd515b
:END:
#+title: python-object-model

* A Deep Dive Into Python's Object/Data Model | Petr Zemek

Sources:

- The ytb video:
  https://www.youtube.com/watch?v=3z3lVhxTkCs
- Blog: Understanding Python metaclasses:
  https://blog.ionelmc.ro/2015/02/09/understanding-python-metaclasses/
- GitHub code for video:
  https://github.com/s3rvac/talks/tree/master/2024-05-14-A-Deep-Dive-Into-Python-Object-Model/examples

** The basics 'class Circle'
#+begin_src python :results output
# The basics.
import math

class GeometricObject:
    pass

class Circle(GeometricObject):
    """A representation of a circle."""
    
    # Konstruktor
    def __init__(self, radius):
        self.radius = radius

    # Metoda / funkce
    def area(self):
        return math.pi * self.radius ** 2

    # Dekorátor @property převádí metodu třídy na atribut, což znamená,
    # že ji můžete volat bez závorek.
    # Místo volání 'circle.diameter()' stačí použít 'circle.diameter'.
    @property # 
    def diameter(self):
        return 2 * self.radius

    @classmethod
    def unit_circle(cls):
        return cls(1)

c1 = Circle(10)
print(c1.radius) # 10
print(c1.area()) # 314.1592653589793
print(c1.diameter) # 20

c2 = Circle.unit_circle()
print(c2.radius) # 1
#+end_src

#+RESULTS:
: 10
: 314.1592653589793
: 20
: 1


#+begin_src python :results output
a = 9
print(a.bit_length())
print(type(a))
print((1).bit_length())
#+end_src

#+RESULTS:
: 4
: <class 'int'>
: 1

#+begin_src python :results output
l = '1'
a = l.split(',')
print(a)
print(type(a))
# Define the two lists
xls_id = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]
gigdb_id = [3, 5, 6, 10, 16]  # Added an extra item for testing

# Find missing items
missing_items = [item for item in gigdb_id if item not in xls_id]

# Check if all items are present
if not missing_items:
    print("All items from gigdb_id are present in xls_id.")
else:
    print("The following items are missing from xls_id:", missing_items)

#+end_src

#+RESULTS:
: ['1']
: <class 'list'>
: The following items are missing from xls_id: [16]
